#language: ru
#1й Шаг
Функционал: : Создать аккаунт и с его помощью произвести действия на сайте

  Предыстория: Пользователь зарегистрировал электронную почту

  Сценарий: Пользователь создает новый аккаунт

    Когда жмем на кнопку Войти на стартовой странице

    Затем видим на странице "Регистрация"
    И жмем на "Соискателя" кнопку
    Затем видим на странице "Регистрация соискателя"
    И вводим в поле "Имя" значение "Петр"
    К тому же проверяем, что в поле "Имя" есть значение

    И вводим в поле "Фамилия" значение "Настенко"
    К тому же проверяем, что в поле "Фамилия" есть значение

    И вводим в поле "Email или телефон" значение "tteessttuser@mail.ru"
    К тому же проверяем, что в поле "Email или телефон" есть значение

    И жмем на "Зарегистрироваться" кнопку


