#language: ru
#2й Шаг
Функционал: Создать аккаунт и с его помощью произвести действия на сайте

  Предыстория: Пользователь зарегистрировал учетную запись ранее

  Сценарий: Пользователь задает свой пароль

    Когда жмем на кнопку Войти на стартовой странице

    Затем видим на странице "Регистрация"
    И жмем на "Получить пароль" кнопку
    Затем видим на странице "Введите email или номер"
    И вводим в поле "Email или телефон" значение "tteessttuser@mail.ru"
    К тому же проверяем, что в поле "Email или телефон" есть значение
    Затем жмем на "Задать пароль"
    #ReCaptcha
    И жмем на "Проверить почту на mail.ru" кнопку


#Переход на сайт Mail.ru

    Затем видим на странице "Войти в аккаунт"
    И вводим в поле "Имя аккаунта" значение "tteessttuser"
    Затем жмем на "Ввести пароль"
    Затем видим на странице "Введите пароль"
    И вводим в поле "Пароль" значение "gremak0891"
    Затем жмем на "Войти"
    Затем видим на странице "Ваш пароль на hh.ru"


