#language: ru
#3й Шаг
Функционал: Создать аккаунт и с его помощью произвести действия на сайте

  Предыстория: Пользователь зарегистрировал учетную запись и получил пароль

  Сценарий: Вход с введеными при регистрации даными

    Когда жмем на кнопку Войти на стартовой странице

    Затем видим на странице "Регистрация"
    И вводим в поле "Email или телефон" значение "tteessttuser@mail.ru"
    К тому же проверяем, что в поле "Email или телефон" есть значение

    И вводим в поле "Пароль" значение "gremak0891"
    К тому же проверяем, что в поле "Пароль" есть значение
    #ReCaptcha
    И жмем на "Войти" кнопку
    Затем видим на странице "Найди работу мечты"
    И жмем на иконку профиля
    Затем видим на странице "Петр Настенко"
